app/Controllers/Artikel.php

  public function admin_index()
  {
    $title = 'Daftar Artikel';
    $model = new ArtikelModel();
    $data = [
      'title' => $title,
      'artikel' => $model->paginate(10), #data dibatasi 10 record per halaman
---
SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`