app/Controllers/Post.php

INSERT INTO `artikel` (`judul`, `isi`) VALUES ('ui ux', 'Tampilan, Pengalaman')
---
    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
        ];
        $model->insert($data);

DELETE FROM `artikel`
WHERE `id` = '4'
AND `id` IN ('4')
DELETE FROM `artikel`
WHERE `id` IN ('4')
---
    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->delete($id);
        if ($data) {
            $model->delete($id);